In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
path = 'Resources/purchase_data.json'
df = pd.read_json(path, orient='columns')
df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [3]:
path2 = 'Resources/purchase_data2.json'
df2 = pd.read_json(path2, orient='columns')
df2.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

In [4]:
heroes2_pd = pd.DataFrame(df2)
heroes2_pd.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

In [5]:
heroes2_pd.shape

(78, 6)

In [6]:
player_count = heroes2_pd["SN"].count()

In [7]:
player_count

78

In [8]:
d = {'Total Player': [player_count]}
total_pl = pd.DataFrame(data=d)
total_pl.head()

   Total Player
0            78

In [9]:
# Count of unique elements
unique_item = heroes2_pd["Item Name"].unique()
item = pd.DataFrame(unique_item).count()
item

0    63
dtype: int64

In [10]:
# Average Price of items
tot_price = heroes2_pd["Price"].sum()
av_price = round((tot_price / item), 2)
av_price

0    3.62
dtype: float64

In [11]:
# Total number of purchase
tot_purchase = heroes2_pd["Item Name"].count()
tot_purchase

78

In [12]:
# Total revenue
tot_rev = round((heroes2_pd["Price"].sum()),2)
tot_rev

228.1

In [13]:
d = {'Number of Unique Elements': item, 'Average price': av_price, 'Number of Purchase': tot_purchase, 'Total revenue': tot_rev}
df = pd.DataFrame(data=d)
df.head()

   Average price  Number of Purchase  Number of Unique Elements  Total revenue
0           3.62                  78                         63          228.1

In [14]:
gender_count = heroes2_pd['Gender'].value_counts()
gender_count

Male                     64
Female                   13
Other / Non-Disclosed     1
Name: Gender, dtype: int64

In [15]:
male_perc = (gender_count['Male']/player_count) * 100
male_perc = "%.2f" % male_perc
male_perc = float(male_perc)

In [16]:
female_perc = (gender_count['Female']/player_count)*100
female_perc =  "%.2f" % female_perc
female_perc = float(female_perc)

In [17]:
other_perc = (gender_count['Other / Non-Disclosed']/player_count)*100
other_perc ="%.2f" % other_perc
other_perc = float(other_perc)

In [18]:
gender_count_pd = pd.DataFrame(gender_count)
gender_count_pd["Percentage of Players"] = (male_perc, female_perc, other_perc)
gender_count_pd.rename(columns = {"Gender": "Total count"}, inplace=True)
gender_count_pd

                       Total count  Percentage of Players
Male                            64                  82.05
Female                          13                  16.67
Other / Non-Disclosed            1                   1.28

In [19]:
gender_demos = heroes2_pd.groupby('Gender')["Price"].agg(['sum', 'mean','count']).sort_values(['sum'],ascending = False).reset_index()

In [20]:
gender_demos

                  Gender     sum      mean  count
0                   Male  184.60  2.884375     64
1                 Female   41.38  3.183077     13
2  Other / Non-Disclosed    2.12  2.120000      1

In [21]:
#Normalization 
gender_normal_f= gender_demos[['sum']].iloc[1,0]/player_count#heroes2_pd[['SN']].iloc[1,0]
gender_normal_m= gender_demos[['sum']].iloc[0,0]/player_count#heroes2_pd[['SN']].iloc[0,0]
gender_normal_o = gender_demos[['sum']].iloc[2,0]/player_count#heroes2_pd[['SN']].iloc[2,0]

In [22]:
gender_count_pd['Normalized Totals'] = [gender_normal_m, gender_normal_f, gender_normal_o]
gender_count_pd

                       Total count  Percentage of Players  Normalized Totals
Male                            64                  82.05           2.366667
Female                          13                  16.67           0.530513
Other / Non-Disclosed            1                   1.28           0.027179

In [23]:
gender_demos

                  Gender     sum      mean  count
0                   Male  184.60  2.884375     64
1                 Female   41.38  3.183077     13
2  Other / Non-Disclosed    2.12  2.120000      1

In [24]:
# Merge Table with gender  information and gender demographic information. Rename Columns
merge_gender = pd.merge(gender_count_pd, gender_demos, right_on= 'Gender', left_index = True)
# = merge_gender.rename(columns = {"count": "Purchase Count","mean":"Average Purchase Price","sum":"Total Purchase Value" })
merge_gender.head()

,Total count,Percentage of Players,Normalized Totals,Gender,sum,mean,count
0,64,82.05,2.366667,Male,184.60,2.884375,64
1,13,16.67,0.530513,Female,41.38,3.183077,13
2,1,1.28,0.027179,Other / Non-Disclosed,2.12,2.120000,1

In [25]:
merge_gender_df = merge_gender.rename(columns = {"count": "Purchase Count","mean":"Average Purchase Price","sum":"Total Purchase Value" })
merge_gender_df.head()

,Total count,Percentage of Players,Normalized Totals,Gender,Total Purchase Value,Average Purchase Price,Purchase Count
0,64,82.05,2.366667,Male,184.60,2.884375,64
1,13,16.67,0.530513,Female,41.38,3.183077,13
2,1,1.28,0.027179,Other / Non-Disclosed,2.12,2.120000,1

In [26]:
# format columns
merge_gender_df['Average Purchase Price'] = merge_gender_df['Average Purchase Price'].map("$ {:,.2f}".format)
merge_gender_df['Total Purchase Value'] = merge_gender_df['Total Purchase Value'].map("$ {:,.2f}".format)
merge_gender_df['Normalized Totals'] = merge_gender_df['Normalized Totals'].map("$ {:,.2f}".format)
merge_gender_df

,Total count,Percentage of Players,Normalized Totals,Gender,Total Purchase Value,Average Purchase Price,Purchase Count
0,64,82.05,$ 2.37,Male,$ 184.60,$ 2.88,64
1,13,16.67,$ 0.53,Female,$ 41.38,$ 3.18,13
2,1,1.28,$ 0.03,Other / Non-Disclosed,$ 2.12,$ 2.12,1

In [27]:
# set Index to Gender
purchasing_analysis_gender = merge_gender_df.set_index('Gender')
purchasing_analysis_gender[['Purchase Count', 'Average Purchase Price', 'Total Purchase Value', 'Normalized Totals']]

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
Gender,,,,
Male,64,$ 2.88,$ 184.60,$ 2.37
Female,13,$ 3.18,$ 41.38,$ 0.53
Other / Non-Disclosed,1,$ 2.12,$ 2.12,$ 0.03

In [28]:
bins = [0, 10, 14, 19, 24, 29, 34, 40, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
heroes2_pd["Age Groups"] = pd.cut(heroes2_pd["Age"], bins, labels=group_names)
heroes2_pd.set_index('Age Groups').head()
bins
heroes2_pd.head()

   Age Gender  Item ID                 Item Name  Price          SN Age Groups
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35      20-24
1   21   Male       12                     Dawne   3.36   Aidaira26      20-24
2   17   Male        5                Putrid Fan   2.63      Irim47      15-19
3   17   Male      123         Twilight's Carver   2.55     Irith83      15-19
4   22   Male      154              Feral Katana   4.11  Philodil43      20-24

In [29]:
heroes_groups = heroes2_pd.groupby("Age Groups")
#heroes_groups.count()
age_group = heroes_groups["Age Groups"].count()
age_group_df = pd.DataFrame(age_group)
age_group_df = age_group_df.rename(columns={"Age Groups":"Count"})
age_group_df = pd.DataFrame(age_group_df)
age_group_df

            Count
Age Groups
<10             5
10-14           3
15-19          11
20-24          36
25-29           9
30-34           7
35-39           7
40+             0

In [30]:
age_group_df.Count

Age Groups
<10       5
10-14     3
15-19    11
20-24    36
25-29     9
30-34     7
35-39     7
40+       0
Name: Count, dtype: int64

In [31]:
total_pl["Total Player"].values[0]

78

In [32]:
age_group_df["Percentage of Players"] = round((age_group_df["Count"] / player_count)*100, 2)
age_group_df

            Count  Percentage of Players
Age Groups
<10             5                   6.41
10-14           3                   3.85
15-19          11                  14.10
20-24          36                  46.15
25-29           9                  11.54
30-34           7                   8.97
35-39           7                   8.97
40+             0                   0.00

In [33]:
age_purchase_total = heroes2_pd.groupby(["Age Groups"])
age_purchase_total_sum = age_purchase_total.sum()
age_purchase_total_sum

              Age  Item ID   Price
Age Groups
<10          40.0    315.0   13.82
10-14        34.0    348.0    8.96
15-19       184.0   1027.0   30.41
20-24       787.0   3622.0  108.89
25-29       231.0    689.0   26.11
30-34       224.0    598.0   13.89
35-39       259.0    728.0   26.02
40+           NaN      NaN     NaN

In [34]:
total_purchase = heroes2_pd.groupby(["Age Groups"]).sum()["Price"]
average_price = heroes2_pd.groupby(["Age Groups"]).mean()["Price"]
purchase_count = heroes2_pd.groupby(["Age Groups"]).count()["Price"]
# Calculate normalized totals
norm_total = age_purchase_total_sum["Price"] / player_count

In [35]:
age_data = pd.DataFrame({
    "Purchase Count": age_group_df["Count"], 
    "Average Purchase Price": average_price, 
    "Total Purchase Value": age_purchase_total_sum["Price"], 
    "Normalized Totals": norm_total
})
age_data.head()

,Average Purchase Price,Normalized Totals,Purchase Count,Total Purchase Value
Age Groups,,,,
<10,2.764000,0.177179,5,13.82
10-14,2.986667,0.114872,3,8.96
15-19,2.764545,0.389872,11,30.41
20-24,3.024722,1.396026,36,108.89
25-29,2.901111,0.334744,9,26.11

In [36]:
top5_spenders = heroes2_pd.groupby('SN')['Price'].sum().sort_values(ascending = False).nlargest(5).reset_index()
top5_spenders_SN = top5_spenders[['SN']]

In [37]:
# merge top 5 spenders with original data set to obtain summary data 
merge_top5_spenders = pd.merge(top5_spenders_SN, heroes2_pd, on = 'SN', how = 'left')
merge_top5_spenders = merge_top5_spenders.groupby('SN')['Price'].agg(['sum', 'mean','count']).sort_values(['sum'], ascending= False)

In [38]:
# rename columns
top_spenders = merge_top5_spenders.rename(columns = {'count': 'Purchase Count', 'mean' : 'Average Purchase Price', 
                                                      'sum' : 'Total Purchase Value' })

In [39]:
# format columns
top_spenders['Average Purchase Price'] = top_spenders['Average Purchase Price'].map("$ {:,.2f}".format)
top_spenders['Total Purchase Value'] = top_spenders['Total Purchase Value'].map("$ {:,.2f}".format)

top_spenders[['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']]

            Purchase Count Average Purchase Price Total Purchase Value
SN
Sundaky74                2                 $ 3.71               $ 7.41
Aidaira26                2                 $ 2.56               $ 5.13
Eusty71                  1                 $ 4.81               $ 4.81
Chanirra64               1                 $ 4.78               $ 4.78
Alarap40                 1                 $ 4.71               $ 4.71

In [40]:
# get list of top 5 most popular items by count
items_bycount = heroes2_pd.groupby(['Item ID','Item Name'])['Price'].agg(['count','sum','mean']).sort_values(['count'], ascending= False).reset_index()
top5_items = items_bycount[:5]
top5_items

   Item ID       Item Name  count    sum  mean
0       94  Mourning Blade      3  10.92  3.64
1       90        Betrayer      2   8.24  4.12
2      111    Misery's End      2   3.58  1.79
3       64   Fusion Pummel      2   4.84  2.42
4      154    Feral Katana      2   8.22  4.11

In [41]:
# get list of top 5 most profitable items by sum
items_bysum = heroes2_pd.groupby(['Item ID','Item Name'])['Price'].agg(['count','sum','mean']).sort_values(['sum'], ascending= False).reset_index()
top5sum_items = items_bysum[:5]

# rename columns
profitable_items = top5sum_items.rename(columns = {'count': 'Purchase Count', 'mean' : 'Item Price', 
                                                    'sum' : 'Total Purchase Value' })

In [42]:
# format columns
profitable_items['Item Price'] = profitable_items['Item Price'].map("$ {:,.2f}".format)
profitable_items['Total Purchase Value'] = profitable_items['Total Purchase Value'].map("$ {:,.2f}".format)

In [43]:
# set Index to Item ID and Item Name
profitable_items_df = profitable_items.set_index(['Item ID', 'Item Name'])
profitable_items_df[['Purchase Count', 'Item Price', 'Total Purchase Value']]

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
94,Mourning Blade,3,$ 3.64,$ 10.92
117,"Heartstriker, Legacy of the Light",2,$ 4.71,$ 9.42
93,Apocalyptic Battlescythe,2,$ 4.49,$ 8.98
90,Betrayer,2,$ 4.12,$ 8.24
154,Feral Katana,2,$ 4.11,$ 8.22